var data = [];
var dataStr = '1、咱们结婚吧<br>\
<br>\
·中文名：《咱们结婚吧》<br>\
·上映时间：2013年11月06日<br>\
·主    演：黄海波，高圆圆，王彤，张凯丽<br>\
·出品公司：完美蓬瑞影视、华录百纳影视<br>\
·该剧讲述的是一位黄金剩女与一位恐婚男之间，如何克服层层障碍，消除彼此心中困惑，战胜双方家长不满，最终有情人终成眷属的爱情故事。<br>\
<br>\
<br>\
2、冰雪奇缘<br>\
<br>\
·中文名：《冰雪奇缘》<br>\
·上映时间：2013年11月27日（美国）2014年2月5日（中国）<br>\
·主    演：克里斯汀·贝尔，伊迪娜·门泽尔，乔纳森·格罗夫<br>\
·出品公司：华特·迪士尼动画工作室<br>\
·影片讲述小国阿伦黛尔因一个魔咒永远地被冰天雪地覆盖，为了寻回夏天，安娜公主和山民克里斯托夫以及他的驯鹿搭档组队出发，为展开一段拯救王国的历险。<br>\
<br>\
<br>\
3、倾城之泪<br>\
<br>\
·中文名：《倾城之泪》<br>\
·上映时间：2011年12月22日<br>\
·主    演：周冬雨，李治廷，任贤齐，梁咏琪，窦骁，陈乔恩<br>\
·出品公司：福建恒业电影发行、上海凯羿影视<br>\
·影片由三颗泪滴组成，三对恋人分别讲述了爱有时间界限、重拾爱情梦想和当爱遭遇生离死别的三段凄美爱情故事。<br>\
<br>\
<br>\
4、蜘蛛侠<br>\
<br>\
·中文名：《超凡蜘蛛侠2》<br>\
·上映时间：2014年5月4日（中国大陆）<br>\
·主    演：安德鲁·加菲尔德，艾玛·斯通，杰米·福克斯，戴恩·德哈恩，莎莉·菲尔德，保罗·吉亚玛提<br>\
·出品公司：漫威电影公司<br>\
·影片讲述了彼得·帕克的生活依然很忙，而格温毕业后考虑去牛津大学继续深造。“电光人”出现后，彼得的生活更不得安宁。老朋友哈利·奥斯本回归，帕克发现了关于自己身世的新线索。<br>\
<br>\
<br>\
5、大唐玄奘<br>\
<br>\
·中文名：《大唐玄奘》<br>\
·上映时间：2016年4月29日<br>\
·主    演：黄晓明，徐峥，蒲巴甲，罗晋，汤镇业<br>\
·出品公司：中国电影股份有限公司、北京环球浩翔影视文化传媒有限公司<br>\
·该片讲述的是唐朝高僧玄奘历时19年，不畏艰难险阻，前往天竺取经的传奇故事。<br>\
<br>\
<br>\
6、鸿门宴<br>\
<br>\
·中文名：《鸿门宴》<br>\
·上映时间：2011年11月29日<br>\
·主    演：黎明，张涵予，刘亦菲，冯绍峰，黄秋生，陈小春，安志杰，修庆<br>\
·出品公司：星光国际传媒有限公司<br>\
·虽然片名为“鸿门宴传奇”，但讲述的不仅仅是那场中国历史上最有名的饭局，而是围绕鸿门宴前后各方势力的权谋争斗，再现了楚汉争霸的整个过程。<br>\
<br>\
<br>\
7、何以笙箫默<br>\
<br>\
·中文名：《何以笙箫默》<br>\
·上映时间：2015年1月10日<br>\
·主    演：钟汉良，唐嫣，谭凯，杨玏，菅韧姿，米露<br>\
·出品公司：上海剧酷文化传播有限公司<br>\
·该片主要讲述何以琛和赵默笙一段年少时的爱恋牵出一生的情缘，一个执着于等待和相爱的故事。<br>\
<br>\
<br>\
8、匆匆那年<br>\
<br>\
·中文名：《匆匆那年》<br>\
·上映时间：2015年1月10日<br>\
·主    演：彭于晏，倪妮，郑恺，魏晨，陈赫，张子萱<br>\
·出品公司：上海剧酷文化传播有限公司<br>\
·该片主要讲述何以琛和赵默笙一段年少时的爱恋牵出一生的情缘，一个执着于等待和相爱的故事。<br>\
<br>\
<br>\
9、同桌的妳<br>\
<br>\
·中文名：《同桌的妳》<br>\
·上映时间：2014年4月25日<br>\
·主    演：周冬雨，林更新，张子枫，李家成，隋凯，王啸坤，龚格尔，李岷城，赵思园，曹阳<br>\
·出品公司：摩天轮文化传媒、光线影业<br>\
·影片主要讲述了周小栀和林一这一对同桌从初中、高中、大学直至毕业十年后的青葱记忆和甜蜜恋情。<br>\
<br>\
<br>\
10、荒野猎人<br>\
<br>\
·中文名：《荒野猎人》<br>\
·上映时间：2016年1月8日(美国)、2016年3月18日（中国大陆）<br>\
·主    演：莱昂纳多·迪卡普里奥，汤姆·哈迪 ，威尔·保尔特 ，多姆纳尔·格利森，保罗·安德森<br>\
·出品公司：20世纪福克斯<br>\
·该片根据迈克尔·彭克同名长篇小说改编，故事讲述19世纪一名皮草猎人休·格拉斯被熊所伤并被其他猎人抢走财物抛弃荒野，猎人经历痛苦奇迹存活后开始复仇的故事。<br>\
<br>\
<br>\
11、千与千寻<br>\
<br>\
·中文名：《千与千寻》<br>\
·上映时间：2001年7月20日（日本）<br>\
·主    演：柊瑠美，入野自由<br>\
·出品公司：东宝映画<br>\
·该片讲述了少女千寻意外来到神灵异世界后发生的故事。<br>\
<br>\
<br>\
12、哆啦A梦：伴我同行<br>\
<br>\
·中文名：《哆啦A梦：伴我同行》<br>\
·上映时间：2014年8月8日（日本） 2015年5月28日（中国大陆）<br>\
·主    演：水田山葵，大原惠，嘉数由美，木村昴，关智一<br>\
·出品公司：2014《哆啦A梦：伴我同行》制作委员会<br>\
·该片讲述了哆啦A梦圆满完成了他的使命，启程返回22世纪，大雄该如何以一己之力实现他那来之不易的幸福未来。<br>\
<br>\
<br>\
13、机械师<br>\
<br>\
·中文名：《机械师》<br>\
·上映时间：2011年1月28日<br>\
·主    演：杰森·斯坦森，本·福斯特，托尼·戈德温，唐纳德·萨瑟兰<br>\
·出品公司：CBS Films<br>\
·该片翻拍自1972年的同名电影，讲述了一个顶尖杀手，带着自己一手培养出来的徒弟执行上司的命令。一名有条不紊的杀手带领一个任性冲动的菜鸟进入了血雨腥风的世界。<br>\
<br>\
<br>\
14、左耳<br>\
<br>\
·中文名：《左耳》<br>\
·上映时间：2015年4月24日<br>\
·主    演：陈都灵，欧豪，杨洋，马思纯，关晓彤，胡夏，段博文<br>\
·出品公司：北京光线影业有限公司、江苏译林影视文化传媒有限公司<br>\
·该片改编自饶雪漫同名小说《左耳》，主要讲述了李珥、张漾、许弋、黎吧啦等一群拥有不同性格的年轻人的青春疼痛故事。<br>\
<br>\
<br>\
15、我的男友和狗<br>\
<br>\
·中文名：《我的男友和狗》<br>\
·上映时间：2015年6月19日（中国内地）<br>\
·主    演：何润东，张钧甯，丁春诚，马思纯<br>\
·出品公司：安可电影、岗华影视、雷公电影<br>\
·影片讲述了时尚编辑蔡琬真和男友沈浩介因爱犬里拉而发生的一系列故事。<br>\
';
var d=dataStr.split('<br><br><br>');
for (var i=0;i<d.length;i++){
    var c=d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.jpg',
        caption:c[0].split('、')[1],
        desc:c[1]
    });   
}
